Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭТ_СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеестрВыплатСамозанятым</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодВалютнойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодВыплат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсполнительныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачислениеДивидендов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежейВБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНалоговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлатежнаяВедомость</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияБанковскихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПлатежноеПоручение/Forms/ФормаДокумента/Ext/Form/Module.bsl
//БезНДС()
//возвращает перечисление СтавкиНДС.БезНДС
&НаСервере
Функция БезНДС()
	Возврат Перечисления.СтавкиНДС.БезНДС;
КонецФункции

//Подготовлено()
//возвращает перечисление СостоянияБанковскихДокументов.Подготовлено 
&НаСервере
Функция Подготовлено()
	Возврат Перечисления.СостоянияБанковскихДокументов.Подготовлено;
КонецФункции

//ПолучитьДатуБрони(Строка)
//разбирает строку и возвращает из нее дату брони
&НаСервере
Функция ПолучитьДатуБрони(Строка)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьДатуИзСтроки(ЭТ_ОбщийМодуль2.ПолучитьНомерБрони(Строка));
КонецФункции

//ПолучитьНомерБрони(Пар)
//разбирает строку и возвращает из нее номер брони
&НаСервере
Функция ПолучитьНомерБрони(Пар)
	Возврат	ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(ЭТ_ОбщийМодуль2.ПолучитьНомерБрони(Пар));
КонецФункции


//ПолучитьДатуСчета(Строка)
//разбирает строку и возвращает из нее дату счета
&НаСервере
Функция ПолучитьДатуСчета(Строка)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьДатуИзСтроки(ЭТ_ОбщийМодуль2.ПолучитьНомерСчета(Строка));
КонецФункции

//ПолучитьНомерСчета(Строка)
//разбирает строку и возвращает из нее номер счета
&НаСервере
Функция ПолучитьНомерСчета(Строка)
	Возврат ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(ЭТ_ОбщийМодуль2.ПолучитьНомерСчета(Строка));
КонецФункции

//КонвертацияДатыИзЮниксВДату(СтроковаяДата)
//конвертирует германский формат даты в Unix строку даты, для возможности дальнейшей обработки в СБ
&НаСервере
Функция КонвертацияДатыИзЮниксВДату(СтроковаяДата)
	Возврат ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВДату(СтроковаяДата);
КонецФункции

//КонвертацияДатыИзЮниксВДату(СтроковаяДата)
//возвращает расчетный счет присланного контрагента
&НаСервере
Функция ПолучитьРасчетныйСчетКонтрагента(Контрагент)
	Возврат Контрагент.ОсновнойБанковскийСчет;
КонецФункции

//ЗаполнитьФормуДокумента(Парам)
//на основании присланной структуры параметров из СБ заполняет форму документа
&НаКлиенте
Процедура ЗаполнитьФормуДокумента(Парам)
	Если НЕ Парам.Контрагент = Неопределено Тогда
		Объект.Контрагент = Парам.Контрагент;
		КонтрагентПриИзменении(ЭтаФорма.Элементы.Контрагент);
		КонтрагентОбработкаВыбора(ЭтаФорма.Элементы.Контрагент, Парам.Контрагент, Ложь);		
		ЭтаФорма.Объект.ДоговорКонтрагента = Парам.ДоговорКонтрагента;
		ЭтаФорма.Элементы.ДоговорКонтрагента.СписокВыбора.Добавить(Парам.ДоговорКонтрагента);
		Объект.СтатьяДвиженияДенежныхСредств = ПолучитьНастройку("СтатьяДвиженияДенежныхСредств");
		Объект.СтавкаНДС = БезНДС();
		Объект.ВидПлатежа = "Электронно";
		Объект.ОчередностьПлатежа = Объект.ОчередностьПлатежа;
		Если Парам.Заявка.Свойство("reservation_number") Тогда
			НомерСчета = ПолучитьНомерСчета(Парам.Заявка.reservation_number);
			ДатаСчета = ПолучитьДатуСчета(Парам.Заявка.reservation_number);
			НомерБрони = ПолучитьНомерБрони(Парам.Заявка.reservation_number);
			ДатаБрони = ПолучитьДатуБрони(Парам.Заявка.reservation_number);
		Иначе
			НомерСчета = "";
			НомерБрони = "";
			ДатаСчета = "";
			ДатаБрони = "";
		КонецЕсли;
		НазначениеПлатежа = "Оплата по ";
		Если СтрДлина(СокрЛП(НомерБрони))>0 Тогда
			НазначениеПлатежа = НазначениеПлатежа + "заявке "+НомерБрони+" ";
		КонецЕсли;
		Если СтрДлина(СокрЛП(НомерСчета))>0 Тогда
			Если СтрДлина(СокрЛП(НомерБрони))>0 Тогда
				НазначениеПлатежа = СокрЛП(НазначениеПлатежа) + ", ";
			КонецЕсли;			
			НазначениеПлатежа = НазначениеПлатежа + "счету № " + НомерСчета+" ";
			Если СтрДлина(СокрЛП(ДатаСчета))>0 Тогда
				НазначениеПлатежа = НазначениеПлатежа + "от "+Формат(ДатаСчета, "ДЛФ=Д")+" ";			
			КонецЕсли;		
		КонецЕсли;                                                                                                		
		НазначениеПлатежа = НазначениеПлатежа + "за тур.услуги ";
		
		ДатаЗаезда = КонвертацияДатыИзЮниксВДату(Парам.Заявка.date_begin);		
		Если СтрДлина(СокрЛП(ДатаЗаезда))>0 Тогда
			НазначениеПлатежа = НазначениеПлатежа + "от "+Лев(СокрЛП(ДатаЗаезда),10)+" ";
		КонецЕсли;
		//
		Если Парам.Заявка.Свойство("id_internal") Тогда
			Если СтрДлина(СокрЛП(Парам.Заявка.id_internal))>0 Тогда
				НазначениеПлатежа = НазначениеПлатежа + "("+СокрЛП(Парам.Заявка.id_internal)+") ";
			КонецЕсли;
		КонецЕсли;
		
		Если Парам.Заявка.Свойство("calc_price_netto") Тогда
			Если СтрДлина(СокрЛП(Парам.Заявка.calc_price_netto))>0 Тогда				
				НазначениеПлатежа = НазначениеПлатежа + "Сумма "+Формат(Парам.Заявка.calc_price_netto,"ЧДЦ=2; ЧРД='-'; ЧГ=0")+" Без налога (НДС)";
				Объект.СуммаДокумента = Парам.Заявка.calc_price_netto;
			КонецЕсли;
		КонецЕсли;
		Объект.НазначениеПлатежа = НазначениеПлатежа;
		Объект.СчетКонтрагента = ПолучитьРасчетныйСчетКонтрагента(Парам.Контрагент);
		ЭтаФорма.Состояние = Подготовлено();
	КонецЕсли;
КонецПроцедуры


//НайтиДоговорТО(НомерЗаявки,НомерБрони,ПоУмолчанию = Ложь)
//По присланному номеру заявки и номеру брони осуществляет поиск ссылки на договор контрагента
//новый договор не создает
//возвращает ссылку
&НаСервере
Функция НайтиДоговорТО(НомерЗаявки,ИНН,НомерБрони,ПоУмолчанию = Ложь)
	ВидДоговораТО = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораТО");
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование 
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	Не ПометкаУдаления		
		|	И (
		|		ДоговорыКонтрагентов.Номер ПОДОБНО  &НомерЗаявки
		|	)		
		|	И ДоговорыКонтрагентов.Владелец.ИНН = &ИНН
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
		|"); 
	Запрос.УстановитьПараметр("НомерЗаявки", "%"+СокрЛП(НомерЗаявки)+"%");	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораТО);		
	Запрос.УстановитьПараметр("НомерБрони", "%"+СокрЛП(НомерБрони)+"%");		
	Запрос.УстановитьПараметр("ИНН", ИНН);		
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 		
		Возврат Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Возврат Ложь;
КонецФункции


//ВернутьКонтрагентаПоЗаявке(Заявка)
//на основании номера заявки возвращает контрагента в 1С 
&НаСервере
Функция ВернутьКонтрагентаПоЗаявке(Заявка)
	//Получаем заявку
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	
	Если Заказчик.Количество()<1 Тогда 
		Сообщить("В заявке U-ON не выбран контрагент.");
		Возврат Справочники.Контрагенты.СоздатьЭлемент();
	КонецЕсли;
	
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Не ПометкаУдаления		
		|	И ((Контрагенты.ИНН = &ИНН И Контрагенты.ИНН<>"""")
		|	ИЛИ (ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ПаспортПолный И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""" И &ПаспортПолный<>"""")
		|	ИЛИ ((Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортПолный ИЛИ Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортНомер) И (Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортДата) И (Контрагенты.ДокументУдостоверяющийЛичность<>"""") И (&ПаспортНомер<>""""))
		|	ИЛИ (Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И Контрагенты.НаименованиеПолное ПОДОБНО &Имя И Контрагенты.НаименованиеПолное ПОДОБНО &Отчество И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ДатаРождения И Контрагенты.НаименованиеПолное<>"""" И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
		|	)
		|"); 
	Если Заказчик.Свойство("u_inn") Тогда Запрос.УстановитьПараметр("ИНН", Заказчик.u_inn);	Иначе Запрос.УстановитьПараметр("ИНН", ""); КонецЕсли;
	Если Заказчик.Свойство("ПаспортПолный") Тогда Запрос.УстановитьПараметр("ПаспортПолный", "%"+Заказчик.u_passport_number+"%"); Иначе Запрос.УстановитьПараметр("ПаспортПолный", ""); КонецЕсли;
	Если Заказчик.Свойство("ПаспортНомер") Тогда Запрос.УстановитьПараметр("ПаспортНомер", "%"+Прав(Заказчик.u_passport_number,6)+"%"); Иначе Запрос.УстановитьПараметр("ПаспортНомер", ""); КонецЕсли;
	Если Заказчик.Свойство("ПаспортДата") Тогда Запрос.УстановитьПараметр("ПаспортДата", "%"+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date)+"%"); Иначе Запрос.УстановитьПараметр("ПаспортДата", "%"); КонецЕсли;
	Если Заказчик.Свойство("Фамилия") Тогда Запрос.УстановитьПараметр("Фамилия", "%"+Заказчик.u_surname+"%"); Иначе Запрос.УстановитьПараметр("Фамилия", ""); КонецЕсли;
	Если Заказчик.Свойство("Имя") Тогда Запрос.УстановитьПараметр("Имя", "%"+Заказчик.u_name+"%"); Иначе  Запрос.УстановитьПараметр("Имя", ""); КонецЕсли;
	Если Заказчик.Свойство("Отчество") Тогда Запрос.УстановитьПараметр("Отчество", "%"+Заказчик.u_sname+"%"); Иначе Запрос.УстановитьПараметр("Отчество", ""); КонецЕсли;
	Если Заказчик.Свойство("ДатаРождения") Тогда Запрос.УстановитьПараметр("ДатаРождения", ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday)); Иначе Запрос.УстановитьПараметр("ДатаРождения", ""); КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Пока Результат.Следующий() Цикл 
		НайденКонтрагент = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	
	Если НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		НайденКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		//Физик или Юрик
		u_company = "";
		Если Заказчик.Свойство("u_company") Тогда u_company = СокрЛП(Заказчик.u_company); КонецЕсли;
		Если СтрДлина(u_company)>0 Тогда
			//заполняем юрика
			НайденКонтрагент.Наименование = Заказчик.u_company;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_company;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;			
		Иначе
			//заполняем физика
			НайденКонтрагент.Наименование = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;
			
			Паспорт = "";
			Если СтрДлина(Заказчик.u_passport_number)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+Заказчик.u_passport_number;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_taken)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+"выдан "+Заказчик.u_passport_taken;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_date)>0 Тогда 				
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;
				Паспорт = Паспорт+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date);
			КонецЕсли;
			Если СтрДлина(Паспорт)>0 Тогда 
				НайденКонтрагент.ДокументУдостоверяющийЛичность = Паспорт;
			КонецЕсли;
			
			ДатаРождения = "";			
			Если СтрДлина(Заказчик.u_birthday)>0 Тогда 
				ДатаРождения = ДатаРождения+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday);
			КонецЕсли;
			
			НайденКонтрагент.Комментарий = "";
			Если СтрДлина(Паспорт)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+Паспорт; КонецЕсли;
			Если СтрДлина(ДатаРождения)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" д.р. "+ДатаРождения; КонецЕсли;
		КонецЕсли;
		НайденКонтрагент.ДополнительнаяИнформация = "";
		Если СтрДлина(Заказчик.address)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Адрес: "+Заказчик.address;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.Представление = СокрЛП(Заказчик.address);				
		КонецЕсли;
		
		Если СтрДлина(Заказчик.u_phone_mobile)>0 ИЛИ СтрДлина(Заказчик.u_phone)>0 Тогда
			Телефоны = Новый Массив(2);
			СчетМассив = 0;
			Если СтрДлина(Заказчик.u_phone_mobile)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone_mobile;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_phone)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone;
			КонецЕсли;				
			Если Телефоны.Количество()>0 Тогда
				Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
				НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Телефоны: "+СокрЛП(СтрСоединить(Телефоны,", "));					
				НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
				НоваяСтрока.Представление = СокрЛП(СтрСоединить(Телефоны,", "));
				НоваяСтрока.НомерТелефона = Телефоны[0];
			КонецЕсли;				
		КонецЕсли;
		
		Если СтрДлина(Заказчик.u_email)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Эл.почта: "+Заказчик.u_email;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.АдресЭП = Заказчик.u_email;
			НоваяСтрока.Представление = СокрЛП(Заказчик.u_email);			
		КонецЕсли;
		КаталогЗаказчиков = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогЗаказчиков");
		НайденКонтрагент.Родитель = КаталогЗаказчиков;
		НайденКонтрагент.Записать();
	КонецЕсли;
	Возврат НайденКонтрагент;
КонецФункции



//СоздатьДоговорТО(Заявка)
//на основании присланной структуры данных заявки из СБ, создает договор с ТО
&НаСервере
Функция СоздатьДоговорТО(Заявка,ИНН)
	Возврат ЭТ_ОбщийМодуль2.СоздатьДоговорТуроператора(Заявка,ИНН);
КонецФункции

//ПолучитьКонтрагентаПоДоговору(Договор)
//на основании присланного договра вернет контрагента по договору
&НаСервере
Функция ПолучитьКонтрагентаПоДоговору(Договор)
	Возврат Договор.Владелец;
КонецФункции

//ПолучитьДанныеКлиента(КодКлиента)
//получает данные клиента из СБ по его коду в СБ
&НаСервере
Функция ПолучитьДанныеКлиента(КодКлиента)
	Возврат ЭТ_ОбщийМодуль2.User(Новый Структура("id",КодКлиента));
КонецФункции

//ПолучитьДанныеЗаявки(СледЗаявкаНомер)
//получает данные заявкив СБ, по ее коду в СБ
&НаСервере
Функция ПолучитьДанныеЗаявки(СледЗаявкаНомер)
	Возврат ЭТ_ОбщийМодуль2.Request(Новый Структура("id",СледЗаявкаНомер));
КонецФункции

//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получает настроцку пользователя по присланному ключу
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

//ПолучитьМассивЗаявок(Параметры)
//осуществляет поиск заявки в СБ, согласно присланной структуре параметров
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//ЭТ_ОткрытьПоискСБВместо(Команда)
//Управляет видимостью панели поиска СБ
&НаКлиенте
Процедура ЭТ_ОткрытьПоискСБВместо(Команда)
		ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = НЕ ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость;
КонецПроцедуры

//ПолучитьВариантыНомера(СтрокаПоиска)
//получает возможные номера поиска, согласно присланной строке поиска
&НаСервере
Функция ПолучитьВариантыНомера(СтрокаПоиска)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьВариантыНомера(СтрокаПоиска);
КонецФункции

&НаСервере
Процедура СобратьТаблицуПоставщиков(СледЗаявка)
	//ИмяТЧ = "ТаблицаПоставщиков";
	//ЗначениеОбъекта = ОбъектСсылка.ПолучитьОбъект();	
	//ТабРез = ЗначениеОбъекта[ИмяТЧ].выгрузить();	
	//ЗначениеВРеквизитФормы(ТабРез,ИмяТЧ);
	//ТабРез = ПолучитьИзВременногоХранилища();	
	//ЭтаФорма.ТаблицаПоставщиков.Загрузить(ТабРез);
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеКонтрагентаПоИНН(ИНН,ПоУмолчанию)
	НайденКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
	Если НЕ (НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка()) Тогда
		Наименование = НайденКонтрагент.Наименование;
	Иначе
		Наименование = ПоУмолчанию;
	КонецЕсли;
	Возврат Наименование;
КонецФункции

&НаСервере
Функция ПолучитьЗаявку(Знач НомерЗаявки)
	КВозврату = Новый Структура;
	Префикс = СокрЛП(ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс","ЭТ18-")); 
	СтрокаПоиска = ВРег(СокрЛП(ЭтаФорма.СтрокаПоиска)); 
	Если СтрНайти(СтрокаПоиска,ВРег(Префикс))=0 Тогда
		СтрокаПоиска = Префикс + СтрокаПоиска;
	КонецЕсли;
	НомерЗаявки = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(СтрокаПоиска,Префикс);
	КВозврату = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру(НомерЗаявки);
	Возврат  КВозврату;
КонецФункции

//ЭТ_ЗаполнитьСБВместо(Команда)
//рекация на нажатие кнопки Заполнить на панеле поиска СБ
&НаКлиенте
Процедура ЭТ_ЗаполнитьСБВместо(Команда)
	Объект.Организация = ПолучитьНастройку("Организация");
	СледЗаявка = ПолучитьЗаявку(ЭтаФорма.СтрокаПоиска);


				//Проверяем наличие договора
				Если СледЗаявка.Свойство("id_internal") Тогда
					//Вычислим количество поставщиков
					ЭтаФорма.ТаблицаПоставщиков.Очистить();
					Для Каждого СледУслуга Из СледЗаявка.services Цикл    
						price_netto = ?(СледУслуга.Свойство("price_netto"),СледУслуга.price_netto,0);						
						Если ?(price_netto = Неопределено,0,price_netto) >0 Тогда
							ИНН = ?(СледУслуга.Свойство("partner_inn"),СледУслуга.partner_inn,"");
							Стоимость = ?(СледУслуга.Свойство("price_netto"),СледУслуга.price_netto,0);
							НайтиСтр = ЭтаФорма.ТаблицаПоставщиков.НайтиСтроки(Новый Структура("ИНН",ИНН));
							Если НайтиСтр.Количество()>0 Тогда
								Стр = НайтиСтр[0];
							Иначе
								Стр = ЭтаФорма.ТаблицаПоставщиков.Добавить();
							КонецЕсли;
							Если СтрДлина(Стр.Наименование)<1 Тогда 
								Наименование = ПолучитьНаименованиеКонтрагентаПоИНН(ИНН,?(СледУслуга.Свойство("partner_name"),СледУслуга.partner_name,""));
							КонецЕсли;							
							Стр.ИНН = ИНН;
							Стр.Наименование = Наименование;
							Стр.Стоимость = Формат(Стоимость,"ЧДЦ=2; ЧРД=; ЧРГ=; ЧГ=");
							//Стр.Стоимость = Число(Стр.Стоимость + Число(СтрЗаменить(Стоимость,",",".")));
							Стр.Заявка = СледЗаявка;
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;       
	
	Если ЭтаФорма.ТаблицаПоставщиков.Количество() = 1 Тогда
		ЭтаФорма.Элементы.ГруппаПоставщиков.Видимость = Ложь;
		ЭТ_СформироватьПлатежкуПоСтроке(0);
	ИначеЕсли ЭтаФорма.ТаблицаПоставщиков.Количество() >0 Тогда
		ЭтаФорма.Элементы.ГруппаПоставщиков.Видимость = Истина;		
	КонецЕсли;
КонецПроцедуры



//ПолучитьСуммуКомиссииТО()
//в договоре с ТО, в комментариях храниться форматированная строка, в которой указан размер комиссии
//возвращает размер комиссии
&НаСервере
Функция ПолучитьСуммуКомиссииТО()
	СуммаКомиссии = 0;
	Если НЕ Объект.ДоговорКонтрагента.Пустая() Тогда
		СуммаКомиссии = ЭТ_ОбщийМодуль2.ПолучитьСуммуКомиссииТО(Объект.ДоговорКонтрагента);
	КонецЕсли;	
	Возврат СуммаКомиссии;
КонецФункции



//ЭТ_ДоговорКонтрагентаПриИзмененииПосле(Элемент)
//При смене договора в форме, получает сумму комиссии с ТО
&НаКлиенте
Процедура ЭТ_ДоговорКонтрагентаПриИзмененииПосле(Элемент)
		ЭтаФорма.Объект.ЭТ_СуммаКомиссии = ПолучитьСуммуКомиссииТО();
КонецПроцедуры


//ЭТ_ПриОткрытииПосле(Отказ)
//при открытии формы выставляем сумму комиссии с ТО (из договора)
&НаКлиенте
Процедура ЭТ_ПриОткрытииПосле(Отказ)
		ЭтаФорма.Элементы.ГруппаПоставщиков.Видимость = Ложь;
		ЭтаФорма.СуммаКомиссии = ПолучитьСуммуКомиссииТО();
КонецПроцедуры




//ЭТ_НазначениеПлатежаПослеНаСервере()
//генерирует строку с основанием платежа, созгасно заданному в настройках шаблону
&НаСервере
Процедура ЭТ_НазначениеПлатежаПослеНаСервере() Экспорт
	//получаем данные шаблонов,
	//ищем нашу компанию
	//если находим - формируем шаблон и производим замену
	СтруктураДанных =  Новый Структура;
	СтруктураДанных.Вставить("бронь",СокрЛП(Объект.ДоговорКонтрагента.Номер));
	СтруктураДанных.Вставить("сумма",Объект.СуммаДокумента);
	СтруктураДанных.Вставить("номерсчета",Объект.Номер);
	СтруктураДанных.Вставить("датасчета",Объект.Дата);
	Шаблон = Эт_ОбщийМодуль2.ОснованиеПлатежаПоШаблону(
		Объект.Контрагент.Код,
		СтруктураДанных
	);
	Если СтрДлина(СокрЛП(Шаблон))>0 Тогда Объект.НазначениеПлатежа = Шаблон; КонецЕсли;
КонецПроцедуры

//ЭТ_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
//см. ЭТ_НазначениеПлатежаПослеНаСервере() - генерация строки оснований платежа
&НаКлиенте
Процедура ЭТ_НазначениеПлатежаПосле(Команда)
	ЭТ_НазначениеПлатежаПослеНаСервере();                       
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_СформироватьПлатежкуПоСтроке(НомерСтроки)
	КодСтрокиУслуги = НомерСтроки;
	НайденДоговор = НайтиДоговорТО(СокрЛП(ЭтаФорма.ТаблицаПоставщиков[КодСтрокиУслуги].Заявка.id_internal),ЭтаФорма.ТаблицаПоставщиков[КодСтрокиУслуги].ИНН,ПолучитьНомерБрони(ЭтаФорма.ТаблицаПоставщиков[КодСтрокиУслуги].Заявка.reservation_number),Ложь);
	Если НЕ НайденДоговор = Ложь Тогда
		Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор);
		ДоговорКонтрагента=НайденДоговор;
	Иначе
		СозданДоговор = СоздатьДоговорТО(ЭтаФорма.ТаблицаПоставщиков[КодСтрокиУслуги].Заявка,ЭтаФорма.ТаблицаПоставщиков[КодСтрокиУслуги].ИНН);
		Если НЕ СозданДоговор.Пустая() Тогда
			Контрагент = ПолучитьКонтрагентаПоДоговору(СозданДоговор);
			ДоговорКонтрагента=СозданДоговор;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьФормуДокумента(Новый Структура("Контрагент, ДоговорКонтрагента, Заявка",Контрагент, ДоговорКонтрагента,ЭтаФорма.ТаблицаПоставщиков[КодСтрокиУслуги].Заявка));		
	//ТекущийЭлемент = ЭтаФорма.Элементы.СуммаДокумента;
	ЭтаФорма.Элементы.ГруппаПоставщиков.Видимость = Ложь;
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = Ложь;
	ЭтаФорма.СуммаКомиссии = ПолучитьСуммуКомиссииТО();
	ЭТ_НазначениеПлатежаПослеНаСервере();		
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ТаблицаПоставщиковВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭТ_СформироватьПлатежкуПоСтроке(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ЭТ_ПриОткрытииПослеНаСервере()
		СуммаКомиссии=2
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ПриОткрытииПосле1(Отказ)
	ЭТ_ПриОткрытииПослеНаСервере();
КонецПроцедуры
